const TermsPage = () => {
    return (
        <div className="p-10">
            <p dir="rtl">
                شروط الخدمة
                مرحبًا بك في منصة قلم الافتراضية! تحكم شروط الخدمة هذه (``الشروط``) وصولك واستخدامك لمنصة مدرستنا الافتراضية، بما في ذلك موقعنا الإلكتروني وتطبيقات الهاتف المحمول وأي خدمات ذات صلة (يُشار إليها إجمالاً بـ ``الخدمة``).
                <br /><br />
                1. قبول الشروط

                من خلال الوصول إلى الخدمة أو استخدامها، فإنك توافق على الالتزام بهذه الشروط. إذا كنت لا توافق على أي جزء من هذه الشروط، فلا يجوز لك الوصول إلى الخدمة أو استخدامها.
                <br /><br />
                2. الأهلية

                يجب أن يكون عمرك 13 عامًا على الأقل حتى تتمكن من استخدام الخدمة. إذا كان عمرك أقل من 18 عامًا، فيجب أن تحصل على إذن من والديك أو الوصي القانوني لاستخدام الخدمة.
                <br /><br />
                3. حسابات المستخدمين
                <br />
                قد تحتاج إلى إنشاء حساب للوصول إلى ميزات معينة في الخدمة. أنت مسؤول عن الحفاظ على سرية معلومات حسابك، بما في ذلك اسم المستخدم وكلمة المرور. أنت أيضًا مسؤول عن جميع الأنشطة التي تحدث ضمن حسابك.
                <br /><br />
                4. المحتوى
                <br />
                قد تحتوي الخدمة على محتوى تم تحميله من قبل المستخدمين، بما في ذلك المعلمين والطلاب والجهات الخارجية الأخرى (``محتوى المستخدم``). أنت وحدك المسؤول عن أي محتوى مستخدم تقوم بتحميله أو نشره على الخدمة. أنت تقر وتضمن أن لديك جميع الحقوق والأذونات اللازمة لتحميل أو نشر محتوى المستخدم هذا على الخدمة.
                <br /><br />
                5. الاستخدام المقبول

                <br />
                يجوز لكم استخدام هذا الموقع فقط لأغراض قانونية. ولا يجوز لكم استخدام الموقع فى حال شمل الاستخدام اى من الحالات التالية:

                بأي طريقة تنتهك أي قوانين أو لوائح معمول بها.
                التعدي على حقوق أي طرف ثالث، بما في ذلك حقوق الملكية الفكرية الخاصة به.
                لنقل أي محتوى ضار أو مسيء أو تهديدي.
                لتعطيل أو التدخل في استخدام الخدمة من قبل الآخرين.
                انتحال شخصية أي شخص أو جهة.
                للوصول غير المصرح به إلى الخدمة.
                <br /><br />
                6. الملكية الفكرية
                <br />
                الخدمة وجميع المحتويات والمواد المضمنة في الخدمة، بما في ذلك على سبيل المثال لا الحصر، النصوص والرسومات والشعارات والصور ومقاطع الصوت ومقاطع الفيديو والبرامج والبيانات (يُشار إليها إجمالاً بـ``المحتوى``) هي ملك لـ منصة قلم الافتراضية أو الجهات المرخصة لها. لا يجوز لك استخدام أي محتوى دون الحصول على إذن كتابي صريح من منصة قلم .

                <br /><br />
                الروابط بالمواقع الأخرى على شبكة الإنترنت7.
                <br />
                قد يشتمل موقعنا على روابط بالمواقع الأخرى على شبكة الإنترنت. او اعلانات من مواقع اخرى ولا نعتبر مسئولين عن أساليب تجميع البيانات من قبل تلك المواقع, يمكنك الاطلاع على سياسات السرية والمحتويات الخاصة بتلك المواقع التي يتم الدخول إليها من خلال أي رابط ضمن هذا الموقع.

                نحن قد نستعين بشركات إعلان لأطراف ثالثة لعرض الإعلانات عندما تزور موقعنا على الويب. يحق لهذه الشركات أن تستخدم معلومات حول زياراتك لهذا الموقع ولمواقع الويب الأخرى (باستثناء الاسم أو العنوان أو عنوان البريد الإلكتروني أو رقم الهاتف)، وذلك من أجل تقديم إعلانات حول البضائع والخدمات التي تهمك. إذا كنت ترغب في مزيد من المعلومات حول هذا الأمر وكذلك إذا كنت تريد معرفة الاختيارات المتاحة لك لمنع استخدام هذه المعلومات من قِبل هذه الشركات ، فالرجاء النقر هنا
                <br /><br />
                8. الإنهاء
                <br />
                يجوز لنا إنهاء وصولك إلى الخدمة في أي وقت ولأي سبب دون إشعار. يجوز لنا أيضًا إزالة أي محتوى مستخدم تقوم بتحميله أو نشره على الخدمة في أي وقت ولأي سبب.
                <br /><br />
                9. إخلاء المسؤولية
                <br />
                يتم تقديم الخدمة `كما هي` و`كما هي متاحة` دون أي ضمان من أي نوع، صريحًا أو ضمنيًا، بما في ذلك على سبيل المثال لا الحصر ضمانات القابلية للتسويق والملاءمة لغرض معين وعدم الانتهاك. نحن لا نضمن أن الخدمة لن تنقطع، أو آمنة، أو خالية من الأخطاء.

                يصرح بالدخول إلى الموقع على أساس مؤقت ونحتفظ بحق سحب أو تعديل الموقع دون أي إشعار. لن نكون مسؤولين في حال عدم عمل الموقع لأي سبب في أي وقت أو لأية فترة.
                <br /><br />

                10. حدود المسؤولية
                <br />
                لن نكون مسؤولين عن أي أضرار تنشأ عن أو تتعلق باستخدامك للخدمة، بما في ذلك على سبيل المثال لا الحصر، الأضرار المباشرة أو غير المباشرة أو العرضية أو الخاصة أو التبعية أو التأديبية.
                <br /><br />
                11. التعويض
                <br />
                أنت توافق على تعويض وحماية منصة قلم الافتراضية ومسؤوليها ومديريها وموظفيها ووكلائها ومرخصيها من وضد أي وجميع المطالبات والخسائر والأضرار والالتزامات والتكاليف والنفقات (بما في ذلك أتعاب المحاماة) الناشئة خارج نطاق أو يتعلق باستخدامك للخدمة أو انتهاكك لهذه الشروط.
                <br /><br />
                12. القانون الحاكم
                <br />
                تخضع هذه الشروط وتفسر وفقًا لقوانين دولة فلسطين، بغض النظر عن تعارضها مع أحكام القوانين.
                <br /><br />
                13. حل النزاعات
                <br />
                يتم حل أي نزاع ينشأ عن هذه الشروط أو يتعلق بها عن طريق التحكيم الملزم وفقًا لقواعد واللوائح الداخلية المتعلقة بالموضوع في دولة فلسطين.
                <br /><br />
                14. الاتفاقية الكاملة
                <br />
                تشكل هذه الشروط الاتفاقية الكاملة بينك وبين منصة قلم فيما يتعلق باستخدام الخدمة.
                <br /><br />
                15. قابلية الفصل
                <br />
                إذا اعتبر أي شرط من هذه الشروط غير صالح أو غير قابل للتنفيذ، فسيتم إلغاء هذا الشرط وتبقى الأحكام المتبقية سارية المفعول والتأثير الكامل.
                <br /><br />
                16. التغييرات في الشروط
                <br />
                يجوز لنا تغيير هذه الشروط في أي وقت عن طريق نشر الشروط المعدلة على الخدمة. أنت مسؤول عن التحقق من الشروط بشكل دوري لمعرفة أي تغييرات. إن استمرارك في استخدام الخدمة بعد نشر الشروط المعدلة يشكل موافقتك على الشروط المعدلة.
                <br /><br />
                17. اتصل بنا
                <br /><br />
                إذا كانت لديك أي أسئلة حول هذه الشروط، فيرجى الاتصال بنا على [email protected]



            </p>
            <h2> 
            <br/><br/>           الفريق القانوني.
            <br /><br/>
            </h2>
        </div>
    );
}

export default TermsPage;