const PolicyPage = () => {
    return (
        <div className="p-10">
            <p dir="rtl">
                ## سياسة الخصوصية لمدرسة قلم الافتراضية
                <br />
                توضح سياسة الخصوصية هذه كيف تقوم مدرسة قلم الافتراضية (``قلم`` أو ``نحن`` أو ``لنا`` أو ``خاصتنا``) بجمع معلوماتك واستخدامها والكشف عنها عند استخدام منصتنا (``قلم``).
                <br /><br />
                **المعلومات التي نجمعها**
                <br />
                نقوم بجمع عدة أنواع مختلفة من المعلومات لأغراض مختلفة لتحسين خدماتنا المقدمة لك.
                <br />
                * **المعلومات الشخصية:** قد تتضمن اسمك وعنوان بريدك الإلكتروني ورقم هاتفك واسم المستخدم وكلمة المرور والمعلومات الديموغرافية (مثل البلد واللغة).
                * **بيانات الاستخدام:** قد يتضمن ذلك معلومات حول كيفية وصولك إلى النظام الأساسي واستخدامه، مثل الصفحات التي تزورها، والميزات التي تستخدمها، والوقت الذي تقضيه على النظام الأساسي، وعنوان IP الخاص بك.
                * **معلومات الطالب:** إذا كنت طالبًا، فقد نجمع معلومات إضافية مثل تقدمك الأكاديمي ونصوصك وسجلات الحضور. سيتم جمع هذه المعلومات بموافقة الطالب أو ولي أمره/ولي أمره.
                * **معلومات المعلم:** إذا كنت معلمًا، فقد نجمع معلومات إضافية مثل مؤهلاتك وخبرتك في التدريس ومواد المنهج الدراسي. سيتم جمع هذه المعلومات بموافقتك.
                <br /><br />
                **كيف نستخدم معلوماتك**
                <br />
                نحن نستخدم المعلومات التي نجمعها لأغراض مختلفة، بما في ذلك:
                <br />
                * توفير المنصة وتشغيلها
                * لإنشاء وإدارة حسابك
                * لمعالجة التسجيل والتسجيل الخاص بك
                * تقديم المحتوى والخدمات التعليمية
                * لتخصيص تجربتك على المنصة
                * للتواصل معك بشأن المنصة، بما في ذلك التحديثات والإعلانات والعروض الترويجية (بموافقتك)
                * لتحليل كيفية استخدامك للمنصة لتحسين خدماتنا
                * للامتثال للمتطلبات القانونية والتنظيمية
                <br /><br />
                **مشاركة معلوماتك**
                <br />
                قد نشارك معلوماتك مع مقدمي خدمات الطرف الثالث الذين يساعدوننا في تشغيل المنصة، مثل معالجات الدفع ومقدمي استضافة البيانات وأدوات الاتصال. لن يستخدم مقدمو الطرف الثالث معلوماتك إلا لتقديم الخدمات المحددة التي تم التعاقد معهم على أدائها لنا.
                <br />
                يجوز لنا أيضًا مشاركة معلوماتك مع أطراف ثالثة إذا طلب منا ذلك بموجب القانون أو إذا كنا نعتقد بحسن نية أن هذا الإجراء ضروري من أجل:
                <br />
                * الالتزام بأحكام القانون أو الالتزام بالإجراءات القانونية المقدمة على قلم
                * حماية حقوق أو ممتلكات قلم والدفاع عنها
                * منع أو التحقيق في أي مخالفات محتملة فيما يتعلق بالمنصة
                <br /><br />
                **الاحتفاظ بالبيانات**
                <br />
                سنحتفظ بمعلوماتك طالما أن حسابك نشط أو حسب الحاجة لتزويدك بالخدمات. سنحتفظ أيضًا بمعلوماتك ونستخدمها بالقدر اللازم للامتثال لالتزاماتنا القانونية وحل النزاعات وتنفيذ اتفاقياتنا.
                <br /><br />
                **خصوصية الأطفال**
                <br />
                منصتنا مخصصة للمستخدمين الذين تبلغ أعمارهم 13 عامًا فما فوق. نحن لا نجمع معلومات شخصية عن عمد من الأطفال دون سن 13 عامًا. إذا كنت أحد الوالدين أو الوصي وتعتقد أن طفلك قد زودنا بمعلومات شخصية، فيرجى الاتصال بنا. إذا علمنا أننا قمنا بجمع معلومات شخصية من طفل أقل من 13 عامًا، فسنتخذ الخطوات اللازمة لحذف تلك المعلومات.
                <br /><br />
                **حقوقك**
                <br />
                لديك حقوق معينة فيما يتعلق بمعلوماتك الشخصية، بما في ذلك:
                <br />
                * الحق في الوصول إلى معلوماتك وتحديثها
                * الحق في طلب حذف معلوماتك
                * الحق في الاعتراض على معالجة معلوماتك
                <br /><br />
                يمكنك ممارسة هذه الحقوق عن طريق الاتصال بنا باستخدام معلومات الاتصال الواردة أدناه.
                <br /><br />
                **حماية**
                <br />
                نحن نتخذ خطوات معقولة لحماية معلوماتك من الوصول غير المصرح به أو الكشف عنها أو تغييرها أو إتلافها. ومع ذلك، لا توجد طريقة آمنة تمامًا للنقل عبر الإنترنت أو التخزين الإلكتروني. ولذلك، لا يمكننا ضمان الأمن المطلق.
                <br /><br />
                ** تغييرات على سياسة الخصوصية هذه **
                <br />
                قد نقوم بتحديث سياسة الخصوصية الخاصة بنا من وقت لآخر. وسوف نقوم بإعلامك بأي تغييرات عن طريق نشر سياسة الخصوصية الجديدة على المنصة.
                <br /><br />
                **اتصل بنا**
                <br />
                إذا كان لديك أي أسئلة حول سياسة الخصوصية هذه، يرجى الاتصال بنا:
                <br />
                * عبر البريد الإلكتروني: [Private E-mail]
                * من خلال زيارة هذه الصفحة على موقعنا: [أدخل رابط الموقع، إن أمكن]


            </p>
            <h2>
                <br /><br />
                الفريق القانوني
                <br /><br />

            </h2>
        </div>
    );
}

export default PolicyPage;